In [29]:
from pandas import DataFrame
df = DataFrame(
                [
                    ['Aryan','Singh','Full-time','adminstration',2,20000],
                    ['Rohan','Agarawal','intern','Technical',3,5000],
                    ['Rjya','Shah','Full-time','adminstration',5,10000],
                    ['Yash','Bhatia','Part-time','Technical',7,10000],
                    ['Siddhant','Khanna','Full-time','Management',6,20000],
                ], columns=['First Name','Last name','Type','Department','YoE','Salary']
              )
df

  First Name Last name       Type     Department  YoE  Salary
0      Aryan     Singh  Full-time  adminstration    2   20000
1      Rohan  Agarawal     intern      Technical    3    5000
2       Rjya      Shah  Full-time  adminstration    5   10000
3       Yash    Bhatia  Part-time      Technical    7   10000
4   Siddhant    Khanna  Full-time     Management    6   20000

1.Make a pivot table which shows average salary of each type of employee for each department.

In [36]:
table = pd.pivot_table(data=df,index='Type',columns='Department',values='Salary')
table

Department  Management  Technical  adminstration
Type
Full-time      20000.0        NaN        15000.0
Part-time          NaN    10000.0            NaN
intern             NaN     5000.0            NaN

2.Make a pivot table which shows the sum and mean of the salaries of each type of employee and the number of employees of each type.

In [41]:
table = pd.pivot_table(df,index='Type',values='Salary',
                       aggfunc=['sum','mean','count'])
table

             sum          mean  count
          Salary        Salary Salary
Type
Full-time  50000  16666.666667      3
Part-time  10000  10000.000000      1
intern      5000   5000.000000      1

In [20]:
import pandas as pd
import numpy as np
df = pd.read_csv('dataset/titanic.csv')
#df.keys()
#age = pd.cut(df['age'], [0, 10, 30, 60, 80])
result = pd.pivot_table(df,index="Sex", values="Survived", columns="Pclass", aggfunc="count")
print(result)

Pclass    1    2    3
Sex
female   92   76  143
male    122  108  346

Write a Pandas program to create a Pivot table and calculate number of women and men were in a particular cabin class.

In [31]:
import pandas as pd
import numpy as np
df = pd.read_csv('dataset/titanic.csv')
#df.keys()
result = pd.pivot_table(df,index="Sex", values='Cabin',columns="Pclass", aggfunc="count")
print(result)

Pclass   1   2  3
Sex
female  81  10  6
male    95   6  6